Repository: ramsalt/kr
Catalog: sites/default/modules/contrib/ip_login/ip_login.*_.po
Languages: fr

source: You can use the !profile_module to add a text field to the user profile to store the user's ip address.
fr: Vous pouvez utiliser le module !profile_module afin d'ajouter un champ de saisie pour les adresses IP dans le profil de l'utilisateur.

source: The field %profile_field you have chosen to store IP matches is accessible by non-administators. It is strongly recommended this field's visibility is kept 'Hidden'.
fr: Le champ %profile_field sélectionné pour contenir les adresses IP est accessible par des non-administrateurs. Il est recommandé de garder ce champ masqué et accessible seulement aux administrateurs.

source: IP Login enabled
fr: Activer IP Login

source: Check to enable IP Login, uncheck to disable. If unchecked no user will be able to login via IP address.
fr: Cocher pour activer IP Login, décocher pour le désactiver. Si décoché, il y'aura pas de connexion automatique d'utilisateurs par adresse IP.

source: Profile module IP address field
fr: Champ du profil qui contient les adresses IP

source: Select the profile field containing the user IP address.
fr: Sélectionner le champ du profile qui contient les adresses IP.

source: This profile field's visiblity should ideally be set to 'Hidden' for best security
fr: La visibilité de ce champ du profil devrait

source: Destination after successful login by IP
fr: Redirection après connection par adresse IP

source: <strong>Leave blank to send user back to their originally requested page</strong>, or enter the Drupal path users should be redirected to when automatically logged in. For example "user" or "&lt;front&gt;" etc.
fr: <strong>Laisser vide pour rediriger l'utilisateur vers la page qu'il a demandée</strong>, ou saisir le chemin Drupal vers lequel l'utilisateur sera redirigé une fois connecté. Par exemple: "user" ou "&lt;front&gt;", etc.

source: Login page link
fr: Lien pour la page de connexion utilisateur

source: A link with text from the <em>Login page link text</em> to log the user in automatically will be added to the login page unless it is blank.
fr: Un lien sera ajouté à la page de connexion utilisateur, à moins que le champ <em>texte du lien pour la page de connexion utilisateur</em> ne soit laissé vide.

source: Login page link text
fr: Texte du lien sur la page de connexion utilisateur

source: Text for link on login page. Blank to remove link, defaults to "Log in automatically"
fr: Texte du lien sur la page de connexion utilisateur. Laisser vide pour ne rien afficher. Valeur par défaut: "Log in automatically".

source: Log in automatically
fr: Me connecter automatiquement

source: Login page help text
fr: Texte de l'aide sur la page de connexion utilisateur

source: Help text under IP Login link on login page. Defaults to 'Your computer's IP address has been matched and validated.' and will not appear if <em>Login page link text</em> is blank.
fr: Texte explicatif sous le lien sur la page de connexion utilisateur. La valeur par défaut est: "Your computer's IP address has been matched and validated." et n'apparaitra pas si le <em>lien sur la page de connexion utilisateur</em> est laissé vide.

source: Your computer's IP address has been matched and validated.
fr: L'adresse IP do votre poste de travail a été reconnue et validée.

source: Weight
fr: Poids

source: Optional. The position withn the login page form for this link.
fr: Optionnel. L'ordre d'affichage dans la page de connexion utilisateur pour ce lien.

source: Login block link
fr: Lien dans le bloc de connexion utilisateur

source: Login block link text
fr: Texte du lien dans le bloc de connexion utilisateur

source: Text for link on login page. Use blank to remove link, defaults to "Log in automatically"
fr: Lien sur la page de connexion utilisateur. Laisser vide pour ne rien afficher. Valeur par défaut: "Log in automatically".

source: Optional. The position withn the login block form for this link.
fr: Optionnel. L'ordre d'affichage dans le bloc de connexion utilisateur pour ce lien.

source: This module allows this site to automatically authenticate and login users arriving with a chosen IP address.
fr: Ce module permet d'authentifier et de connecter un compte utilisateur d'après son adresse IP.

source: IP values can be stored in a user's profile (using the core <em>Profile</em> module) in the field selected by the <em>Profile module IP address</em> field, below.
fr: Les adresses ou plages d'adresses IP sont stockées dans le profil de l'utilisateur (il faut activer le module <em>Profil</em> fournit avec le core de Drupal). Il faut saisir le nom du champ du module profil qui contient les adresses IP à utiliser ci-bas.

source: It also allows users with the <code>administer ip login</code> and <code>can log in as another user</code> <a href="@permissions-link">permissions</a> to log out and log in as another user, with other users being forced to stay logged in.
fr: Il permet également aux comptes utilisateurs avec les <a href="@permissions-link">permissions</a> <code>administrer IP Login</code> et <code>peut se connecter avec un autre compte</code> de se déconnecter et de se reconnecter en utilisant un autre compte, alors que les utilisateurs n'ayant pas ces droits ne peuvent pas se déconnecter.

source: Accepted profile field IP values are:
fr: Les formes d'adresses IP acceptées sont:

source: Single IP matches like <code>123.123.123.123</code>
fr: Adresse IP unique comme <code>123.123.123.123</code>

source: Wildcards using an asterisk (<code>*</code>) in any quadrant except the first one, for example <code>123.123.123.*</code> or <code>100.*.*.*</code> etc.
fr: En utilisant l'astérisque (<code>*</code>) remplaçant n'importe quel entier de 0 à 255, dans n'importe quel octet, excepté le premier, par exemple: <code>123.123.123.*</code> ou <code>100.*.*.*</code>, etc.

source: Ranges using a hyphen (<code>-</code>) in any quadrant except the first one, for example <code>123.123.123.100-200</code> etc.
fr: Plages d'adresse utilisant le trait d'union (<code>-</code>) dans nimporte quel octet, excepté le premier, par exemple: <code>123.123.123.100-200</code>.

source: Any number of comma-separated IP addresses or ranges like <code>10.11.12.13, 123.123.123.100-200, 123.123.124-125.*</code> etc.
fr: Toute combinaison d'adresses ou de plages dans une liste séparée par des virgules, par exemple: <code>10.11.12.13, 123.123.123.100-200, 123.123.124-125.*</code>.

source: Welcome %name. You have been automatically logged into %sitename.
fr: Bienvenue %name, vous avez été connecté automatiquement au site %sitename.

source: You may also <a href="@other_user_link">log in as another user</a> if required.
fr: Vous pouvez <a href="@other_user_link">vous connecter avec un autre compte</a> au besoin.

source: This account does not have permission to log out once logged in automatically. You have been logged back in.
fr: Ce compte n'a pas l'autorisation de se déconnecter une fois connecté par adresse IP. Vous avez été reconnecté automatiquement.

source: user
fr: utilisateur

source: Session opened for %name by IP Login.
fr: Ouverture de session par adresse IP pour %name

source: Session closed for %name.
fr: Session terminée pour %name.

source: administer ip login
fr: administrer IP Login

source: can log in as another user
fr: peut se connecter avec un autre compte

source: Automatically log me in by IP
fr: Me connecter automatiquement par adresse IP

source: IP Login settings
fr: Configurer IP Login

source: Configure IP Login settings
fr: Modifier la configuration de IP Login

source: Allows users to login automatically by an IP address, range or wildcards specified in a profile field
fr: Permet de connecter des comptes par adresse ou plage d'adresses IP spécifiées dans un champ du profil utilisateur
